from enum import Enum


class ItemsPlayer(Enum):
    # ====================================== #

    ADVENTURE = [
        'одежда путешественика',
        'монеты (20 з.м)',
        'короткий меч',
        'сумки для зелий',
        'фонарь',
        'верёвка (10 м)'
    ]

    WARLOR = [
        'Длинный меч',
        'кольчужные доспехи',
        'щит',
        'монеты (20 з.м)',
        'сумка для зелий'
    ]

    MAG = [
        'посох мага',
        'мантия мага',
        'монеты (20 з.м)',
        'книга заклинаний',
        'мешочек с компонентами',
        'зелье лечения'
    ]

    ENGINNER = [
        'гаечный ключ',
        'рабочая форма',
        'набор инструментов',
        'чертежи',
        'порох (мешок)',
        'фонарь'
    ]

    ROGUE = [
        'кинжал',
        'отмычки',
        'воровской набор',
        'плащ с капюшоном',
        'монеты (20 з.м)',
        'яд (флакон)'
    ]

    CLERIC = [
        'булава',
        'священный символ',
        'кольчуга',
        'щит',
        'монеты (20 з.м)',
        'зелье лечения'
    ]

    RANGER = [
        'длинный лук',
        'колчан (20 стрел)',
        'короткий меч',
        'кожаный доспех',
        'набор для выживания',
        'монеты (20 з.м)'
    ]

    PALADIN = [
        'длинный меч',
        'щит',
        'кольчуга',
        'священный символ',
        'монеты (20 з.м)',
        'зелье лечения'
    ]

    BARBARIAN = [
        'секира',
        'ручной топор',
        'шкура животного',
        'набор путешественника',
        'монеты (20 з.м)'
    ]

    BARD = [
        'лютня',
        'кинжал',
        'кожаный доспех',
        'набор артиста',
        'монеты (20 з.м)',
        'зелье лечения'
    ]

    # ====================================== #

    def __init__(self, l):
        self._items = l
        self._N = len(l)

    def getItemIndex(self, index: int) -> str | None:
        if self._items[index] is None:
            return self._items[index]
        else:
            return None

    def getItemFirst(self) -> str:
        return self._items[0]

    def getItemEnd(self) -> str:
        return self._items[self._N - 1]

    def getItems(self) -> list[str]:
        return self._items
